<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"7bb3e9d65a651aacae3e3e762c702e220003ee77c6f59c0f039ee9efe9b20a6d","plan_job_ref":"Job Pull Request Checks #222 at https://github.com/GSA-TTS/FAC/actions/runs/5733663472","plan_hash":"916080ae6fed7b38a77ba2c0cd39060d02ef3b7be58dc81acce25d2439079740","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dev.cloudfoundry_app.postgrest will be updated in-place
  ~ resource "cloudfoundry_app" "postgrest" {
      ~ environment                     = (sensitive value)
        id                              = "5de6f04c-52e0-400f-961a-16243b1c7c9a"
      ~ id_bg                           = "************************************" -> (known after apply)
        name                            = "postgrest"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev.cloudfoundry_service_key.postgrest will be created
  + resource "cloudfoundry_service_key" "postgrest" {
      + credentials      = (sensitive value)
      + id               = (known after apply)
      + name             = "postgrest"
      + service_instance = (known after apply)
    }

  # module.dev.module.database.cloudfoundry_service_instance.rds will be created
  + resource "cloudfoundry_service_instance" "rds" {
      + id                             = (known after apply)
      + name                           = "fac-db"
      + recursive_delete               = true
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "5ed9f319-4c75-4851-9885-598a96b7febc"
      + space                          = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #222](https://github.com/GSA-TTS/FAC/actions/runs/5733663472)